# ✨ <u>Projeto Sprint 2</u>

<br>


# <i>Análise do Risco de Inadimplência dos Mutuários</i>

O objetivo desse projeto é preparar um **relatório para a divisão de empréstimos de um banco**. Onde será necessário descobrir se o estado civil de um cliente e o número de filhos têm impacto sobre se ele deixará de pagar um empréstimo. O banco já tem alguns dados sobre a capacidade de crédito dos clientes e esses dados estão no arquivo CSV "credit_scoring_eng".

Seu relatório será considerado ao criar uma **pontuação de crédito** de um cliente em potencial. Lembrando que a  contagem de crédito é usada para avaliar a capacidade de um devedor em potencial de pagar seu empréstimo.

<br>

**<u>Hipóteses a serem testadas:</u>**
- Existe alguma relação entre ter filhos e pagar um empréstimo em dia?
- Existe alguma relação entre o estado civil e o pagamento de um empréstimo no prazo estipulado?
- Existe uma relação entre o nível de renda e o pagamento de um empréstimo no prazo?
- Como as diferentes finalidades do empréstimo afetam o pagamento pontual do empréstimo?

<br>

**Desenvolvido por: Yasmin Zanon Barg.**

---

# Conteúdo <a id='back'></a>

* [Etapa 1. Visão Geral dos Dados](#data_review)
    * [1.1 Overview do Dataframe](#data_review_overview)
    * [1.2 Conhecendo os Dados das Colunas do Dataframe](#data_review_columns)
    * [1.3 Examinando os Valores Faltantes](#data_review_valores_faltantes)
    * [1.4 Conclusões](#data_review_conclusions)
* [Etapa 2. Pré-Processamento de Dados](#data_preprocessing)
    * [2.1 Ajustando Valores das Colunas](#ajustando_valores)
    * [2.2 Duplicatas](#duplicates)
    * [2.3 Valores Ausentes](#missing_values)
    * [2.4 Conclusões](#data_preprocessing_conclusions)
* [Etapa 3. Categorizando Dados](#categorizando_dados)
    * [3.1 Coletando Dados Para a Hipótese 1](#dados_filhos)
    * [3.2 Coletando Dados Para a Hipótese 2](#dados_estado_civil)
    * [3.3 Coletando Dados Para a Hipótese 3](#dados_renda)
    * [3.4 Coletando Dados Para a Hipótese 4](#dados_finalidades)
* [Etapa 4. Validando Hipóteses](#hypotheses)
    * [4.1 Hipótese 1: Existe Alguma Relação Entre ter Filhos e Pagar um Empréstimo em dia?](#filhos)
    * [4.2 Hipótese 2: Existe Alguma Relação Entre o Estado Civil e o Pagamento de um Empréstimo no prazo Estipulado?](#estado_civil)
    * [4.3 Hipótese 3: Existe Uma Relação Entre o Nível de Renda e o Pagamento de um Empréstimo no Prazo?](#renda)
    * [4.4 Hipótese 4: Como as Diferentes Finalidades do Empréstimo Afetam o Pagamento Pontual do Empréstimo?](#finalidades)
* [Conclusão Final](#end)

---

## Etapa. Visão Geral do Dados <a id='data_review'></a>

Essa fase tem o próposito de explorar os dados entregues e nos familiarizar com eles para podermos seguir com as próximas etapas das analises.

### Overview do Dataframe <a id='data_review_overview'></a>

In [9]:
# Primeiramente é necessário importar as bibliotecas necessárias
import pandas as pd 


# Carregando os dados
credit_scoring = pd.read_csv('credit_scoring_eng.csv')

**Descrição dos dados**
- `children` - o número de crianças na família
- `days_employed` - experiência de trabalho em dias
- `dob_years` - idade do cliente em anos
- `education` - educação do cliente
- `education_id` - identificador de educação
- `family_status` - estado civil do cliente
- `family_status_id` - identificador de estado civil
- `gender` - gênero do cliente
- `income_type` - tipo de emprego
- `debt` - havia alguma dívida no pagamento do empréstimo
- `total_income` - renda mensal
- `purpose` - o objetivo de obter um empréstimo

**Agora utilizaremos as funções: `info()`, `head()` e `describe()` para explorar e nos familiarizar ainda mais com os dados que estão no dataframe credit_scoring**

In [10]:
# Vamos ver quantas linhas e colunas nosso conjunto de dados tem
credit_scoring.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [11]:
# vamos exibir as primeiras linhas
credit_scoring.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding

In [12]:
# Tendo um overview das váriaveis númericas
credit_scoring.describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21525.000000,19351.000000,21525.000000,21525.000000,21525.000000,21525.000000,19351.000000
mean,0.538908,63046.497661,43.293380,0.817236,0.972544,0.080883,26787.568355
std,1.381587,140827.311974,12.574584,0.548138,1.420324,0.272661,16475.450632
min,-1.000000,-18388.949901,0.000000,0.000000,0.000000,0.000000,3306.762000
25%,0.000000,-2747.423625,33.000000,1.000000,0.000000,0.000000,16488.504500
50%,0.000000,-1203.369529,42.000000,1.000000,0.000000,0.000000,23202.870000
75%,1.000000,-291.095954,53.000000,1.000000,1.000000,0.000000,32549.611000
max,20.000000,401755.400475,75.000000,4.000000,4.000000,1.000000,362496.645000

### Conhecendo os Dados das Colunas do Dataframe <a id='data_review_columns'></a>

**Agora iremos analisar os valores das colunas individualmente:**

* `children` = o número de crianças na família

In [13]:
# Explorando os valores e as quantidades de dados
credit_scoring['children'].value_counts(dropna=False)

 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

* `days_employed` = quanto tempo o cliente trabalhou

In [14]:
# Explorando os valores e as quantidades de dados
credit_scoring['days_employed'].value_counts(dropna=False)

 NaN              2174
-8437.673028         1
-5135.928528         1
 354500.415854       1
-769.717438          1
                  ...
-1099.957609         1
-209.984794          1
 398099.392433       1
-1271.038880         1
-1984.507589         1
Name: days_employed, Length: 19352, dtype: int64

* `dob_years` = a idade do cliente

In [15]:
# Explorando os valores e as quantidades de dados
credit_scoring['dob_years'].value_counts(dropna=False)

35    617
40    609
41    607
34    603
38    598
42    597
33    581
39    573
31    560
36    555
44    547
29    545
30    540
48    538
37    537
50    514
43    513
32    510
49    508
28    503
45    497
27    493
56    487
52    484
47    480
54    479
46    475
58    461
57    460
53    459
51    448
59    444
55    443
26    408
60    377
25    357
61    355
62    352
63    269
64    265
24    264
23    254
65    194
22    183
66    183
67    167
21    111
0     101
68     99
69     85
70     65
71     58
20     51
72     33
19     14
73      8
74      6
75      1
Name: dob_years, dtype: int64

* `education` = o nível de educação do cliente

In [16]:
# Explorando os valores e as quantidades de dados
credit_scoring['education'].value_counts(dropna=False)

secondary education    13750
bachelor's degree       4718
SECONDARY EDUCATION      772
Secondary Education      711
some college             668
BACHELOR'S DEGREE        274
Bachelor's Degree        268
primary education        250
Some College              47
SOME COLLEGE              29
PRIMARY EDUCATION         17
Primary Education         15
graduate degree            4
Graduate Degree            1
GRADUATE DEGREE            1
Name: education, dtype: int64

* `education_id` = identificador da educação do cliente

In [17]:
# Explorando os valores e as quantidades de dados
credit_scoring['education_id'].value_counts(dropna=False)

1    15233
0     5260
2      744
3      282
4        6
Name: education_id, dtype: int64

* `family_status` = estado civil do cliente

In [18]:
# Explorando os valores e as quantidades de dados
credit_scoring['family_status'].value_counts(dropna=False)

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widow / widower        960
Name: family_status, dtype: int64

* `family_status_id` = identificador do estado civil do cliente

In [19]:
# Explorando os valores e as quantidades de dados
credit_scoring['family_status_id'].value_counts(dropna=False)

0    12380
1     4177
4     2813
3     1195
2      960
Name: family_status_id, dtype: int64

* `gender` = o sexo do cliente

In [20]:
# Explorando os valores e as quantidades de dados
credit_scoring['gender'].value_counts(dropna=False)

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

* `income_type` = o tipo de renda do cliente

In [21]:
# Explorando os valores e as quantidades de dados
credit_scoring['income_type'].value_counts(dropna=False)

employee                       11119
business                        5085
retiree                         3856
civil servant                   1459
unemployed                         2
entrepreneur                       2
student                            1
paternity / maternity leave        1
Name: income_type, dtype: int64

* `debt` = se o cliente já deixou de pagar um empréstimo

In [22]:
# Explorando os valores e as quantidades de dados
credit_scoring['debt'].value_counts(dropna=False)

0    19784
1     1741
Name: debt, dtype: int64

* `total_income` = renda mensal

In [23]:
# Explorando os valores e as quantidades de dados
credit_scoring['total_income'].value_counts(dropna=False)

NaN          2174
17312.717       2
42413.096       2
31791.384       2
21005.772       1
             ...
27020.895       1
23686.835       1
9606.294        1
28156.762       1
13127.587       1
Name: total_income, Length: 19349, dtype: int64

* `purpose` = motivo para fazer um empréstimo

In [24]:
# Explorando os valores e as quantidades de dados
credit_scoring['purpose'].value_counts(dropna=False)

wedding ceremony                            797
having a wedding                            777
to have a wedding                           774
real estate transactions                    676
buy commercial real estate                  664
buying property for renting out             653
housing transactions                        653
transactions with commercial real estate    651
purchase of the house                       647
housing                                     647
purchase of the house for my family         641
construction of own property                635
property                                    634
transactions with my real estate            630
building a real estate                      626
buy real estate                             624
building a property                         620
purchase of my own house                    620
housing renovation                          612
buy residential real estate                 607
buying my own car                           505
going to university                         496
car                                         495
second-hand car purchase                    489
to own a car                                480
buying a second-hand car                    479
cars                                        478
to buy a car                                472
supplementary education                     462
car purchase                                462
purchase of a car                           455
university education                        453
education                                   447
to get a supplementary education            447
getting an education                        443
profile education                           436
getting higher education                    426
to become educated                          412
Name: purpose, dtype: int64

### Examinando os Valores Faltantes <a id='data_review_valores_faltantes'></a>

In [25]:
# Utilizando a função isna() em conjunto com sum() para obter as informações dos dados com valores ausentes
credit_scoring.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

In [26]:
# Filtrando o dataframe "credit_scoring" para mostrar somente os valores faltantes 
credit_scoring_NaN = credit_scoring[credit_scoring['days_employed'].isna()]
credit_scoring_NaN

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21489,2,NaN,47,Secondary Education,1,married,0,M,business,0,NaN,purchase of a car
21495,1,NaN,50,secondary education,1,civil partnership,1,F,employee,0,NaN,wedding ceremony
21497,0,NaN,48,BACHELOR'S DEGREE,0,married,0,F,business,0,NaN,building a property
21502,1,NaN,42,secondary education,1,married,0,F,employee,0,NaN,building a real estate
21510,2,NaN,28,secondary education,1,married,0,F,employee,0,NaN,car purchase

In [27]:
# Calculando a porcentagem do nosso dataframe que está comprometido com valores faltantes

percentage_nan = (len(credit_scoring_NaN.index) / len(credit_scoring.index))*100
percentage_nan

10.099883855981417

**Observações:**

Identificado que simetricamente quando há um valor é NaN na coluna "days_employed" ela também será NaN na coluna "total_income".

Também foi calculado que um pouco mais de 10% da nossa amostra está comprometida devido aos valores NaN, o que é um valor consideravel do nosso dataframe.

Agora iremos verificar se há alguma dependência de valores ausentes em relação aos outros valores dos indicadores, caso não tenha, poderemos substituir esses valores pela média ou mediana.

In [28]:
credit_scoring_NaN['children'].value_counts(dropna=False)

 0     1439
 1      475
 2      204
 3       36
 20       9
 4        7
-1        3
 5        1
Name: children, dtype: int64

In [29]:
credit_scoring_NaN['dob_years'].value_counts(dropna=False)

34    69
40    66
42    65
31    65
35    64
36    63
47    59
41    59
30    58
28    57
58    56
57    56
54    55
56    54
38    54
52    53
37    53
33    51
39    51
50    51
43    50
45    50
49    50
51    50
29    50
46    48
55    48
48    46
44    44
53    44
60    39
62    38
61    38
32    37
64    37
23    36
27    36
26    35
59    34
63    29
25    23
24    21
65    20
66    20
21    18
22    17
67    16
0     10
68     9
71     5
69     5
20     5
70     3
72     2
19     1
73     1
Name: dob_years, dtype: int64

In [30]:
credit_scoring_NaN['education'].value_counts(dropna=False)

secondary education    1408
bachelor's degree       496
SECONDARY EDUCATION      67
Secondary Education      65
some college             55
Bachelor's Degree        25
BACHELOR'S DEGREE        23
primary education        19
Some College              7
SOME COLLEGE              7
Primary Education         1
PRIMARY EDUCATION         1
Name: education, dtype: int64

In [31]:
credit_scoring_NaN['education_id'].value_counts(dropna=False)

1    1540
0     544
2      69
3      21
Name: education_id, dtype: int64

In [32]:
credit_scoring_NaN['family_status_id'].value_counts(dropna=False)

0    1237
1     442
4     288
3     112
2      95
Name: family_status_id, dtype: int64

In [33]:
credit_scoring_NaN['gender'].value_counts(dropna=False)

F    1484
M     690
Name: gender, dtype: int64

In [34]:
credit_scoring_NaN['family_status'].value_counts(dropna=False)

married              1237
civil partnership     442
unmarried             288
divorced              112
widow / widower        95
Name: family_status, dtype: int64

In [35]:
credit_scoring_NaN['income_type'].value_counts(dropna=False)

employee         1105
business          508
retiree           413
civil servant     147
entrepreneur        1
Name: income_type, dtype: int64

In [36]:
credit_scoring_NaN['debt'].value_counts(dropna=False)

0    2004
1     170
Name: debt, dtype: int64

In [37]:
credit_scoring['purpose'].value_counts(dropna=False)

wedding ceremony                            797
having a wedding                            777
to have a wedding                           774
real estate transactions                    676
buy commercial real estate                  664
buying property for renting out             653
housing transactions                        653
transactions with commercial real estate    651
purchase of the house                       647
housing                                     647
purchase of the house for my family         641
construction of own property                635
property                                    634
transactions with my real estate            630
building a real estate                      626
buy real estate                             624
building a property                         620
purchase of my own house                    620
housing renovation                          612
buy residential real estate                 607
buying my own car                           505
going to university                         496
car                                         495
second-hand car purchase                    489
to own a car                                480
buying a second-hand car                    479
cars                                        478
to buy a car                                472
supplementary education                     462
car purchase                                462
purchase of a car                           455
university education                        453
education                                   447
to get a supplementary education            447
getting an education                        443
profile education                           436
getting higher education                    426
to become educated                          412
Name: purpose, dtype: int64

**Observações:**

Todas as colunas possuem valores bem diverisificados e não foi possível identificar nenhum padrão entre os valores das colunas e dos valores faltantes.

### Conclusões <a id='data_review_conclusions'></a>

**Ao realizar a exploração de dados no dataframe 'credit_scoring' foi possível identificar os seguintes problemas que precisam ser tratados:**


**1º)** Os valores da coluna <i>"education"</i> possuem categorias repetidas, devido `erro de grafia`;

**2º)** A coluna <i>"children"</i> possui `valores negativos` que não eram pra existir, além de 76 clientes que possuem a quantidade colossal de 20 filhos;

**3º)** A coluna <i>"days_employed"</i> também possuem `valores negativos` que precisam ser analisados;

**4º)** Todas as colunas estão com seus nomes corretamente formatados (em minusculo, singular e com snake_case), entretanto a coluna <i>"dob_years"</i> que carrega os valores da idade dos clientes poderia ter um `nome mais claro`, como: "customer_age". Ademais, essa coluna também possui alguns `valores de idade zerado`;

**5º)** A coluna <i>"gender"</i> tem uma pessoa com o sexo "XNA" que `não existe`;

**6º)** Precisa ser visto também as `duplicatas` desse dataframe;

**7º)** Será necessário ajustar os 4348  `valores faltantes` das colunas <i>"days_employed"</i> e <i>"total_income"</i>.

<div class="alert alert-block alert-success">
<b>Comentário do corretor</b> <a class="tocSkip"></a>

Bem observado!
</div>

[Voltar ao Índice](#back)

---

## Etapa. Pré-processamento de dados <a id='data_preprocessing'></a>

Aqui iremos sanar os sete tópicos informados na secção a cima que precisam de ajuste, como valores ausentes, duplicatas e erros de grafia que depois de tratados, nos permitiram manipular os dados e tomar decisões mais precisas.

### Ajustando valores das colunas <a id='ajustando_valores'></a>

**1º Passo** -  Corrigir os `erros de grafia` dos valores na coluna <i>"education"</i>:

In [38]:
# Validando todos os valores
credit_scoring['education'].unique()

array(["bachelor's degree", 'secondary education', 'Secondary Education',
       'SECONDARY EDUCATION', "BACHELOR'S DEGREE", 'some college',
       'primary education', "Bachelor's Degree", 'SOME COLLEGE',
       'Some College', 'PRIMARY EDUCATION', 'Primary Education',
       'Graduate Degree', 'GRADUATE DEGREE', 'graduate degree'],
      dtype=object)

In [39]:
# Alterando todos valores para letra minuscúla
credit_scoring['education'] = credit_scoring['education'].str.lower()

In [40]:
# Verificando se o ajuste a cima deu certo
credit_scoring['education'].unique()

array(["bachelor's degree", 'secondary education', 'some college',
       'primary education', 'graduate degree'], dtype=object)

**2º Passo** -  Corrigir o `valor negativo` e a quantidade colossal de `20 filhos` da coluna <i>"children"</i>:

In [41]:
# Vamos ver a distribuição de valores na coluna `children`
credit_scoring['children'].value_counts(dropna=False)

 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

In [42]:
# Calculando a porcentagem da amostra que posssui valor negativo
percentage_negative_children = (47 / len(credit_scoring['children'].index)) * 100
percentage_negative_children

0.2183507549361208

Como a taxa é muito pequena, menor que 1%, será excluido os dados negativos para não comprometer a análise.

In [43]:
# Deletando o registro que possui o valor negativo
negative_children = credit_scoring[credit_scoring['children'] < 0]
credit_scoring = credit_scoring.drop(negative_children.index)

In [44]:
# É muito díficil uma família ter 20 filhos, então provavelmente essa quantidade foi escrita errada, adicionando um zero atrás
credit_scoring['children'] = credit_scoring['children'].replace(20, 2)

In [45]:
# Verificar a coluna `children` novamente para ter certeza de que está tudo corrigido
credit_scoring['children'].value_counts(dropna=False)

0    14149
1     4818
2     2131
3      330
4       41
5        9
Name: children, dtype: int64

**3º Passo** -  Corrigir os `valores negativos` da coluna <i>"days_employed"</i>:

In [46]:
# Quantidade de valores da coluna `days_employed` negativos:
negative_days_employed = credit_scoring[credit_scoring['days_employed'] < 0]
negative_days_employed

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
5,0,-926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house
...,...,...,...,...,...,...,...,...,...,...,...,...
21519,1,-2351.431934,37,graduate degree,4,divorced,3,M,employee,0,18551.846,buy commercial real estate
21520,1,-4529.316663,43,secondary education,1,civil partnership,1,F,business,0,35966.698,housing transactions
21522,1,-2113.346888,38,secondary education,1,civil partnership,1,M,employee,1,14347.610,property
21523,3,-3112.481705,38,secondary education,1,married,0,M,employee,1,39054.888,buying my own car
21524,2,-1984.507589,40,secondary education,1,married,0,F,employee,0,13127.587,to buy a car

In [47]:
# Porcentagem dos valores negativos da coluna "days_employed"
percentage_negative_days_employed = (15869 / len(credit_scoring['days_employed'].index)) * 100
percentage_negative_days_employed

73.884905484682

Cerca de 73% do nosso dataframe possue valores negativos, o que leva a conclusão que provavelmente esses erros foram ocasionados por problemas técnicos que multiplicaram esses dados por -1, deixando eles negativos e a solução seria usar o método abs() para deixar os valores positivos novamente e deixar eles o mais próximo da realidade.

OBS: Os valores NaN serão tratados posteriormente.

In [48]:
# Usando a função abs() para deixar os valores positivos
days_employed = abs(credit_scoring['days_employed'])
credit_scoring['days_employed'] = days_employed

In [49]:
# Verifique o resultado - certifique-se de que está corrigido
credit_scoring

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21520,1,4529.316663,43,secondary education,1,civil partnership,1,F,business,0,35966.698,housing transactions
21521,0,343937.404131,67,secondary education,1,married,0,F,retiree,0,24959.969,purchase of a car
21522,1,2113.346888,38,secondary education,1,civil partnership,1,M,employee,1,14347.610,property
21523,3,3112.481705,38,secondary education,1,married,0,M,employee,1,39054.888,buying my own car
21524,2,1984.507589,40,secondary education,1,married,0,F,employee,0,13127.587,to buy a car

**4º Passo** - Mudar o `nome da coluna` <i>"dob_years"</i> e análisar os 101 valores que estão com a `idade zerada`:

In [50]:
# Deixando o nome da coluna mais claro
credit_scoring = credit_scoring.rename(columns={
'dob_years': 'customer_age',
})

In [51]:
credit_scoring.columns

Index(['children', 'days_employed', 'customer_age', 'education',
       'education_id', 'family_status', 'family_status_id', 'gender',
       'income_type', 'debt', 'total_income', 'purpose'],
      dtype='object')

In [52]:
# Verificando os valores da coluna `customer_age`
credit_scoring['customer_age'].value_counts(dropna=False)

35    616
40    607
41    605
34    600
38    596
42    595
33    579
39    573
31    558
36    555
44    545
29    545
30    539
48    537
37    535
50    512
43    512
49    508
32    508
28    501
45    497
27    492
56    487
52    484
47    480
54    477
46    472
58    461
57    458
53    458
51    447
59    443
55    442
26    407
60    377
25    357
61    354
62    352
63    268
64    264
24    264
23    253
65    194
22    183
66    183
67    167
21    111
0     101
68     99
69     84
70     65
71     58
20     51
72     33
19     14
73      8
74      6
75      1
Name: customer_age, dtype: int64

In [53]:
# Analisadndo o dataframe somente com os valores que estão zerados:

customer_age_zero = credit_scoring[credit_scoring['customer_age'] == 0]
customer_age_zero

,children,days_employed,customer_age,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
99,0,346541.618895,0,secondary education,1,married,0,F,retiree,0,11406.644,car
149,0,2664.273168,0,secondary education,1,divorced,3,F,employee,0,11228.230,housing transactions
270,3,1872.663186,0,secondary education,1,married,0,F,employee,0,16346.633,housing renovation
578,0,397856.565013,0,secondary education,1,married,0,F,retiree,0,15619.310,construction of own property
1040,0,1158.029561,0,bachelor's degree,0,divorced,3,F,business,0,48639.062,to own a car
...,...,...,...,...,...,...,...,...,...,...,...,...
19829,0,NaN,0,secondary education,1,married,0,F,employee,0,NaN,housing
20462,0,338734.868540,0,secondary education,1,married,0,F,retiree,0,41471.027,purchase of my own house
20577,0,331741.271455,0,secondary education,1,unmarried,4,F,retiree,0,20766.202,property
21179,2,108.967042,0,bachelor's degree,0,married,0,M,business,0,38512.321,building a real estate
21313,0,1268.487728,0,secondary education,1,unmarried,4,M,employee,0,24387.070,housing transactions

Como se trata de uma váriavel quantitativa e que não há valores atípicos significativos, será necessário calcular a média entre as idade e adiciona-las na tabela para não deixar os valores ausentes.

In [54]:
# Filtrando onde não tem os valores zerados
credit_scoring_no_zero = credit_scoring[credit_scoring['customer_age']!= 0]

# Calculando a média da idade para cada gênero
age_avg = credit_scoring_no_zero['customer_age'].mean()

credit_scoring['customer_age'] = credit_scoring['customer_age'].replace(0, 43.49950881788838)

In [55]:
# Verifique o resultado - certifique-se de que está corrigido
credit_scoring[credit_scoring['customer_age'] == 0]

Empty DataFrame
Columns: [children, days_employed, customer_age, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose]
Index: []

**5º Passo** - Ajustar a coluna <i>"gender"</i> que tem uma pessoa com o sexo "XNA" que `não existe`

In [56]:
# Validando os valores da coluna "genre" 
credit_scoring['gender'].value_counts(dropna=False)

F      14201
M       7276
XNA        1
Name: gender, dtype: int64

In [57]:
# Como se trata de apenas um valor, iremos deleta-lo, para não impactar na nossa análise:

XNA_gender = credit_scoring[credit_scoring['gender'] == 'XNA']
credit_scoring = credit_scoring.drop(XNA_gender.index)

In [58]:
# Verificando o resultado 
credit_scoring['gender'].value_counts(dropna=False)

F    14201
M     7276
Name: gender, dtype: int64

### Duplicatas <a id='duplicates'></a>

In [59]:
# Verificando as duplicatas
credit_scoring.duplicated().sum()

71

In [60]:
# Deletando os valores duplicados
credit_scoring = credit_scoring.drop_duplicates().reset_index(drop = True)

In [61]:
# Validando se o ajuste deu certo
credit_scoring.duplicated().sum()

0

In [62]:
#Verificando o tamanho do conjunto de dados após modificação
credit_scoring.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21406 entries, 0 to 21405
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21406 non-null  int64
 1   days_employed     19306 non-null  float64
 2   customer_age      21406 non-null  float64
 3   education         21406 non-null  object
 4   education_id      21406 non-null  int64
 5   family_status     21406 non-null  object
 6   family_status_id  21406 non-null  int64
 7   gender            21406 non-null  object
 8   income_type       21406 non-null  object
 9   debt              21406 non-null  int64
 10  total_income      19306 non-null  float64
 11  purpose           21406 non-null  object
dtypes: float64(3), int64(4), object(5)
memory usage: 2.0+ MB

In [63]:
# Tendo um overview dos dados
credit_scoring.describe()

,children,days_employed,customer_age,education_id,family_status_id,debt,total_income
count,21406.000000,19306.000000,21406.000000,21406.000000,21406.000000,21406.000000,19306.000000
mean,0.479445,66935.937260,43.478905,0.817014,0.973933,0.081286,26792.210382
std,0.756517,139052.078307,12.215010,0.548862,1.421618,0.273280,16485.907915
min,0.000000,24.141633,19.000000,0.000000,0.000000,0.000000,3306.762000
25%,0.000000,926.990457,33.000000,1.000000,0.000000,0.000000,16481.736750
50%,0.000000,2194.190166,43.000000,1.000000,0.000000,0.000000,23201.873500
75%,1.000000,5541.117779,53.000000,1.000000,1.000000,0.000000,32551.974250
max,5.000000,401755.400475,75.000000,4.000000,4.000000,1.000000,362496.645000

### Valores ausentes  <a id='missing_values'></a>

Como visto anteriormente,todas as colunas possuem valores bem diverisificados e não foi possível identificar nenhum padrão entre os valores das colunas e dos valores faltantes.

Entretanto para que a gente não perca dez por cento do nosso dataframe, iremos substituir esses valores faltantes que são quantitativos pela média ou mediana da coluna, assim não comprometendo os nossos dados.

Lembrando asque se trata de 4348 valores faltantes das colunas "days_employed" e "total_income".

**1º) Análisando a coluna "days_employed" para substituir seus valores:**

In [64]:
# Verificando se há valores atípicos da nossa coluna:
credit_scoring['days_employed'].describe()

count     19306.000000
mean      66935.937260
std      139052.078307
min          24.141633
25%         926.990457
50%        2194.190166
75%        5541.117779
max      401755.400475
Name: days_employed, dtype: float64

OBS: Descobrimos que a coluna "days_employed" possui valores atípicos que distorcem nossa média, então iremos utilizar o valor da médiana, que é o valor exato da metade da nossa amostra.

In [65]:
# Valor da mediana
days_employed_median = credit_scoring['days_employed'].median()

In [66]:
# Substituindo os valores ausentes da coluna "days_employed"
credit_scoring['days_employed'] = credit_scoring['days_employed'].fillna(days_employed_median)

In [67]:
# Conferindo se o ajuste funcionou no dataframe:
credit_scoring.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21406 entries, 0 to 21405
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21406 non-null  int64
 1   days_employed     21406 non-null  float64
 2   customer_age      21406 non-null  float64
 3   education         21406 non-null  object
 4   education_id      21406 non-null  int64
 5   family_status     21406 non-null  object
 6   family_status_id  21406 non-null  int64
 7   gender            21406 non-null  object
 8   income_type       21406 non-null  object
 9   debt              21406 non-null  int64
 10  total_income      19306 non-null  float64
 11  purpose           21406 non-null  object
dtypes: float64(3), int64(4), object(5)
memory usage: 2.0+ MB

**2º) Análisando a coluna "total_income" para substituir seus valores:**

In [68]:
# Verificando se há valores atípicos da nossa coluna:
credit_scoring['total_income'].describe()

count     19306.000000
mean      26792.210382
std       16485.907915
min        3306.762000
25%       16481.736750
50%       23201.873500
75%       32551.974250
max      362496.645000
Name: total_income, dtype: float64

OBS: Podemos notar que a coluna "total_income" não possui valores atípicos, tanto que a média e a mediana possui valores bem próximos, então para substituir os dados faltantes dessa coluna, será utilizado a média.

In [69]:
# Valor da média
total_income_mean = credit_scoring['total_income'].mean()

In [70]:
# Substituindo os valores ausentes da coluna "total_income"
credit_scoring['total_income'] = credit_scoring['total_income'].fillna(total_income_mean)

In [71]:
# Conferindo se o ajuste funcionou no dataframe:
credit_scoring.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21406 entries, 0 to 21405
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21406 non-null  int64
 1   days_employed     21406 non-null  float64
 2   customer_age      21406 non-null  float64
 3   education         21406 non-null  object
 4   education_id      21406 non-null  int64
 5   family_status     21406 non-null  object
 6   family_status_id  21406 non-null  int64
 7   gender            21406 non-null  object
 8   income_type       21406 non-null  object
 9   debt              21406 non-null  int64
 10  total_income      21406 non-null  float64
 11  purpose           21406 non-null  object
dtypes: float64(3), int64(4), object(5)
memory usage: 2.0+ MB

### Conclusões  <a id='#data_preprocessing_conclusions'></a>

Nesta fase nós tratamos alguns problemas:

- Valores negativos
- Valores zerados
- Erros de grafia
- Valores ausentes
- Duplicatas

E agora possuimos resultados mais precisos e mais fáceis de entender para seguirmos com as próximas etapas.

[Voltar ao Índice](#back)

---

## Categorização de dados <a id='categorizando_dados'></a>

Nesta etapa iremos organizar alguns dados selecionados em grupos para nós auxiliar a responder as hipóteses na próxima fase.

### Coletando dados para a hipótese 1 <a id='dados_filhos'></a>

Existe alguma relação entre ter filhos e pagar um empréstimo em dia?

In [72]:
# Exibindo os valores unicos da coluna "children"

credit_scoring['children'].unique()

array([1, 0, 3, 2, 4, 5])

In [73]:
# Exibindo a quantidade de dados que temos por valores

credit_scoring['children'].value_counts(dropna=False)

0    14090
1     4808
2     2128
3      330
4       41
5        9
Name: children, dtype: int64

In [74]:
# Comparando a quantidade de filho com a quantidade de clientes que não ter pagaram o empréstimo

credit_scoring.groupby('children')['debt'].sum()

children
0    1063
1     444
2     202
3      27
4       4
5       0
Name: debt, dtype: int64

In [75]:
# Calculando taxa em relação a quantidade de filho e a de crédito
avg_children_debt = (credit_scoring.groupby('children')['debt'].sum() / credit_scoring['children'].value_counts(dropna=False)) *100
avg_children_debt

children
0    7.544358
1    9.234609
2    9.492481
3    8.181818
4    9.756098
5    0.000000
dtype: float64

É possível validar que a porcentagem vária um pouco dependendo da quantidade de filho que o cliente tem, então para filtrar a pontuação de crédito que o cliente terá, iremos categorizar esses dados com uma função chamada "calculate_points":

In [76]:
def calculate_points(row):
    children = row['children']

    points = 0
    
    if children == 0 | children == 3:
        points += 1
    if children == 1 | children == 2 | children == 4:
        points += 2
    return points

In [77]:
# Criando uma coluna no dataframe para armazenar os pontos
credit_scoring['points'] = credit_scoring.apply(
    calculate_points, axis=1
)

credit_scoring

,children,days_employed,customer_age,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,points
0,1,8437.673028,42.0,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,0
1,1,4024.803754,36.0,secondary education,1,married,0,F,employee,0,17932.802,car purchase,0
2,0,5623.422610,33.0,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,0
3,3,4124.747207,32.0,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,1
4,0,340266.072047,53.0,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
21401,1,4529.316663,43.0,secondary education,1,civil partnership,1,F,business,0,35966.698,housing transactions,0
21402,0,343937.404131,67.0,secondary education,1,married,0,F,retiree,0,24959.969,purchase of a car,0
21403,1,2113.346888,38.0,secondary education,1,civil partnership,1,M,employee,1,14347.610,property,0
21404,3,3112.481705,38.0,secondary education,1,married,0,M,employee,1,39054.888,buying my own car,1
21405,2,1984.507589,40.0,secondary education,1,married,0,F,employee,0,13127.587,to buy a car,0

### Coletando dados para a hipótese 2 <a id='dados_estado_civil'></a>

In [78]:
# Exibindo os valores unicos da coluna "family_status"

credit_scoring['family_status'].unique()

array(['married', 'civil partnership', 'widow / widower', 'divorced',
       'unmarried'], dtype=object)

In [79]:
# Exibindo a quantidade de dados que temos por valores

credit_scoring['family_status'].value_counts(dropna=False)

married              12310
civil partnership     4145
unmarried             2805
divorced              1191
widow / widower        955
Name: family_status, dtype: int64

In [80]:
# Comparando estado civil do cliente com a quantidade que não pagaram o empréstimo

credit_scoring.groupby('family_status')['debt'].sum()

family_status
civil partnership    388
divorced              85
married              930
unmarried            274
widow / widower       63
Name: debt, dtype: int64

In [81]:
# Calculando taxa de relação ao estado civil e ao crédito
avg_family_status_debt = (credit_scoring.groupby('family_status')['debt'].sum() / credit_scoring['family_status'].value_counts(dropna=False)) *100
avg_family_status_debt.sort_values()

widow / widower      6.596859
divorced             7.136860
married              7.554833
civil partnership    9.360676
unmarried            9.768271
dtype: float64

In [82]:
# Verificando o valor de cada id

credit_scoring.groupby('family_status_id')['family_status'].unique()

family_status_id
0              [married]
1    [civil partnership]
2      [widow / widower]
3             [divorced]
4            [unmarried]
Name: family_status, dtype: object

Agora que já possuimos as porcentagens em mãos, podemos implentar mais a nossa função "calculate_points":

In [83]:
def calculate_points(row):
    children = row['children']
    family_status_id = row['family_status_id']
    
    
    points = 0
    
    # Levando em consideração a taxa de inadimplência de clientes que possuem filhos
    if children == 0 or children == 3:
        points += 1
    if children == 1 or children == 2 or children == 4:
        points += 2
    
    # Levando em consideração a taxa de inadimplência em relação ao estado civil do cliente
    if family_status_id == 3 or family_status_id == 0:
        points += 1
    if family_status_id == 1:
        points += 2
    if family_status_id == 4:    
        points += 3
        
    return points

In [84]:
# Validando os novos valores
credit_scoring['points'] = credit_scoring.apply(
    calculate_points, axis=1
)

credit_scoring

,children,days_employed,customer_age,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,points
0,1,8437.673028,42.0,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,3
1,1,4024.803754,36.0,secondary education,1,married,0,F,employee,0,17932.802,car purchase,3
2,0,5623.422610,33.0,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,2
3,3,4124.747207,32.0,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,2
4,0,340266.072047,53.0,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
21401,1,4529.316663,43.0,secondary education,1,civil partnership,1,F,business,0,35966.698,housing transactions,4
21402,0,343937.404131,67.0,secondary education,1,married,0,F,retiree,0,24959.969,purchase of a car,2
21403,1,2113.346888,38.0,secondary education,1,civil partnership,1,M,employee,1,14347.610,property,4
21404,3,3112.481705,38.0,secondary education,1,married,0,M,employee,1,39054.888,buying my own car,2
21405,2,1984.507589,40.0,secondary education,1,married,0,F,employee,0,13127.587,to buy a car,3

### Coletando Dados para a Hipótese 3 <a id='dados_renda'></a>

In [85]:
# Tendo uma noção geral dos dados
credit_scoring['total_income'].describe()

count     21406.000000
mean      26792.210382
std       15656.336846
min        3306.762000
25%       17208.100500
50%       24969.962000
75%       31334.833750
max      362496.645000
Name: total_income, dtype: float64

In [86]:
# Utilizando a função calculate_income_status para filtrar os valores das rendas

def calculate_income_status(row):
    total_income = row['total_income']
    
    if total_income <= 5000:
        return "low income"
    if total_income <= 15000:
        return "median income"
    if total_income <= 30000:
        return "reasonable income"                      
    if total_income <= 60000:
        return "good income"
    return "great income"

OBS: Não foi informado em qual moeda o salário mensal foi nos dado, então não é possível validar se esses valores são altos ou não.

In [87]:
# Criando a coluna para os filtros realizados a cima
credit_scoring['income_status'] = credit_scoring.apply(
    calculate_income_status, axis=1
)

credit_scoring

,children,days_employed,customer_age,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,points,income_status
0,1,8437.673028,42.0,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,3,good income
1,1,4024.803754,36.0,secondary education,1,married,0,F,employee,0,17932.802,car purchase,3,reasonable income
2,0,5623.422610,33.0,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,2,reasonable income
3,3,4124.747207,32.0,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,2,good income
4,0,340266.072047,53.0,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,3,reasonable income
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21401,1,4529.316663,43.0,secondary education,1,civil partnership,1,F,business,0,35966.698,housing transactions,4,good income
21402,0,343937.404131,67.0,secondary education,1,married,0,F,retiree,0,24959.969,purchase of a car,2,reasonable income
21403,1,2113.346888,38.0,secondary education,1,civil partnership,1,M,employee,1,14347.610,property,4,median income
21404,3,3112.481705,38.0,secondary education,1,married,0,M,employee,1,39054.888,buying my own car,2,good income
21405,2,1984.507589,40.0,secondary education,1,married,0,F,employee,0,13127.587,to buy a car,3,median income

In [88]:
# Validando os valores
credit_scoring['income_status'].value_counts(dropna=False).sort_values()

low income              26
great income           672
median income         3710
good income           5238
reasonable income    11760
Name: income_status, dtype: int64

In [89]:
# Comparando os status de renda com os clientes que não pagam empréstimos
credit_scoring.groupby('income_status')['debt'].sum().sort_values()

income_status
low income              2
great income           38
median income         296
good income           398
reasonable income    1006
Name: debt, dtype: int64

In [90]:
# Calculando taxa em relação a renda dos clientes e a de crédito
avg_total_income_debt = (credit_scoring.groupby('income_status')['debt'].sum().sort_values() / credit_scoring['income_status'].value_counts(dropna=False).sort_values()) *100
avg_total_income_debt.sort_values()

income_status
great income         5.654762
good income          7.598320
low income           7.692308
median income        7.978437
reasonable income    8.554422
dtype: float64

In [91]:
# Acrescentando mais uma validação em nossa função "calculate_points"

def calculate_points(row):
    children = row['children']
    family_status_id = row['family_status_id']
    income_status = row['income_status']
    
    points = 0
    
    # Levando em consideração a taxa de inadimplência de clientes que possuem filhos
    if children == 0 or children == 3:
        points += 1
    if children == 1 or children == 2:
        points += 2
    
    # Levando em consideração a taxa de inadimplência em relação ao estado civil do cliente
    if family_status_id == 3 or family_status_id == 0:
        points += 1
    if family_status_id == 1:
        points += 2
    if family_status_id == 4:    
        points += 3
    
    # Levando em consideração a taxa de inadimplência em relação a renda mensal do cliente
    if income_status == "good income" or income_status == "low income":
        points += 1
    if income_status == "median income":
        points += 2
    if income_status == "reasonable income":
        points += 3
        
    return points

In [92]:
# Aplicando coluna que aplica a quantidade de pontos:

credit_scoring['points'] = credit_scoring.apply(calculate_points, axis=1)

credit_scoring.head()

,children,days_employed,customer_age,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,points,income_status
0,1,8437.673028,42.0,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,4,good income
1,1,4024.803754,36.0,secondary education,1,married,0,F,employee,0,17932.802,car purchase,6,reasonable income
2,0,5623.422610,33.0,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,5,reasonable income
3,3,4124.747207,32.0,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,3,good income
4,0,340266.072047,53.0,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,6,reasonable income

### Coletando Dados para a Hipótese 4 <a id='dados_finalidades'></a>

In [93]:
# Verificando valores da tabela "purpose"
credit_scoring['purpose'].value_counts(dropna=False).sort_values()

to become educated                          408
getting higher education                    426
profile education                           434
getting an education                        441
education                                   444
to get a supplementary education            445
university education                        451
purchase of a car                           455
supplementary education                     458
car purchase                                459
to buy a car                                470
to own a car                                476
cars                                        477
buying a second-hand car                    477
second-hand car purchase                    485
car                                         492
going to university                         496
buying my own car                           504
buy residential real estate                 604
housing renovation                          606
buy real estate                             617
purchase of my own house                    619
building a property                         619
building a real estate                      621
transactions with my real estate            624
property                                    632
construction of own property                634
purchase of the house for my family         638
purchase of the house                       643
housing                                     645
transactions with commercial real estate    649
buying property for renting out             650
housing transactions                        651
buy commercial real estate                  661
real estate transactions                    673
to have a wedding                           764
having a wedding                            767
wedding ceremony                            791
Name: purpose, dtype: int64

In [94]:
# Categorizando a coluna purpose:

def purpose_categorizing(row):
    purpose = row['purpose']
    
    if purpose == "to become educated" or purpose == "profile education" or purpose == "getting higher education" or purpose == "getting an education" or purpose == "to get a supplementary education" or purpose == "education" or purpose == "university education" or purpose == "supplementary education" or purpose == "going to university":
        return "education"
    if purpose == "purchase of a car" or purpose == "car purchase" or purpose == "cars" or purpose == "to own a car" or purpose == "second-hand car purchase" or purpose == "buying a second-hand car" or purpose == "buying my own car" or purpose == "to buy a car" or purpose == "car":
        return "car"
    if purpose == "housing renovation" or purpose == "buy residential real estate" or purpose == "buy real estate" or purpose == "transactions with my real estate" or purpose == "construction of own property" or purpose == "building a property" or purpose == "purchase of the house for my family" or purpose == "property" or purpose == "purchase of my own house" or purpose == "building a real estate" or purpose == "housing transactions" or purpose == "transactions with commercial real estate" or purpose == "housing" or purpose == "buying property for renting out" or purpose == "purchase of the house" or purpose == "buy commercial real estate" or purpose == "real estate transactions":
        return "property"
    if purpose == "having a wedding" or purpose == "to have a wedding" or purpose == "wedding ceremony":
        return "wedding"
    else:
        return "unknown"

In [95]:
# Aplicando função na coluna
credit_scoring['purpose'] = credit_scoring.apply(purpose_categorizing, axis=1)

credit_scoring.head()

,children,days_employed,customer_age,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,points,income_status
0,1,8437.673028,42.0,bachelor's degree,0,married,0,F,employee,0,40620.102,property,4,good income
1,1,4024.803754,36.0,secondary education,1,married,0,F,employee,0,17932.802,car,6,reasonable income
2,0,5623.422610,33.0,secondary education,1,married,0,M,employee,0,23341.752,property,5,reasonable income
3,3,4124.747207,32.0,secondary education,1,married,0,M,employee,0,42820.568,education,3,good income
4,0,340266.072047,53.0,secondary education,1,civil partnership,1,F,retiree,0,25378.572,wedding,6,reasonable income

In [96]:
# Validando os valores da "purpose"
credit_scoring['purpose'].value_counts(dropna=False).sort_values()

wedding       2322
education     4003
car           4295
property     10786
Name: purpose, dtype: int64

In [97]:
# Comparando os motivos de empréstimos com os clientes que não o pagam
credit_scoring.groupby('purpose')['debt'].sum().sort_values()

purpose
wedding      186
education    370
car          402
property     782
Name: debt, dtype: int64

In [98]:
# Calculando taxa em relação a renda dos clientes e a de crédito
avg_purpose_debt = (credit_scoring.groupby('purpose')['debt'].sum().sort_values() / credit_scoring['purpose'].value_counts(dropna=False).sort_values()) *100
avg_purpose_debt.sort_values()

purpose
property     7.250139
wedding      8.010336
education    9.243068
car          9.359721
dtype: float64

In [99]:
# Acrescentando mais uma validação em nossa função "calculate_points"

def calculate_points(row):
    children = row['children']
    family_status_id = row['family_status_id']
    income_status = row['income_status']
    purpose = row['purpose']
    
    points = 0
    
    # Levando em consideração a taxa de inadimplência de clientes que possuem filhos
    if children == 0 or children == 3:
        points += 1
    if children == 1 or children == 2:
        points += 2
    
    # Levando em consideração a taxa de inadimplência em relação ao estado civil do cliente
    if family_status_id == 3 or family_status_id == 0:
        points += 1
    if family_status_id == 1:
        points += 2
    if family_status_id == 4:    
        points += 3
    
    # Levando em consideração a taxa de inadimplência em relação a renda mensal do cliente
    if income_status == "good income" or income_status == "low income":
        points += 1
    if income_status == "median income":
        points += 2
    if income_status == "reasonable income":
        points += 3
    
    # Levando em consideração a taxa de inadimplência em relação ao motivo de empréstimo do cliente
    if purpose == "property" or purpose == "wedding":
        points += 1
    if purpose == "education" or purpose == "car":
        points += 2
        
    return points

In [100]:
# Testando função
row_values = [0, 2, "reasonable income","car"]
row_columns = ['children','family_status_id', 'income_status','purpose']
row = pd.Series(data=row_values, index=row_columns)
print(calculate_points(row))

6

In [101]:
# Aplicando coluna que aplica a quantidade de pontos:

credit_scoring['points'] = credit_scoring.apply(calculate_points, axis=1)

credit_scoring.head()

,children,days_employed,customer_age,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,points,income_status
0,1,8437.673028,42.0,bachelor's degree,0,married,0,F,employee,0,40620.102,property,5,good income
1,1,4024.803754,36.0,secondary education,1,married,0,F,employee,0,17932.802,car,8,reasonable income
2,0,5623.422610,33.0,secondary education,1,married,0,M,employee,0,23341.752,property,6,reasonable income
3,3,4124.747207,32.0,secondary education,1,married,0,M,employee,0,42820.568,education,5,good income
4,0,340266.072047,53.0,secondary education,1,civil partnership,1,F,retiree,0,25378.572,wedding,7,reasonable income

In [102]:
# Verificando os valores da coluna "points":

credit_scoring['points'].value_counts(dropna=False).sort_values()

2        9
10     137
3      261
9      938
4     1669
8     3074
5     3633
6     5675
7     6010
Name: points, dtype: int64

**Observação:**

Quando maior o número da coluna "points"(máximo 10 pontos), maior a chance do cliente não pagar o seu empréstimo.

[Voltar ao Índice](#back)

---

## Validando Hipóteses <a id='hypotheses'></a>

### Existe Alguma Relação Entre ter Filhos e Pagar um Empréstimo em dia? <a id='filhos'></a>

**Resposta**

Podemos notar com os valores das porcentagens que quando o cliente possui um filho ou mais, a tendência é que a taxa aumente, ou seja, que há mais possibilidade dele não pagar seu empréstimo.

In [103]:
avg_children_debt.sort_values()

children
5    0.000000
0    7.544358
3    8.181818
1    9.234609
2    9.492481
4    9.756098
dtype: float64

OBS: A única execção da taxa é referente aos clientes que possuem 5 filhos, entretando temos muito pouca amostra desses clientes.

### Existe Alguma Relação Entre o Estado Civil e o Pagamento de um Empréstimo no prazo Estipulado? <a id='estado_civil'></a>

**Resposta**

Existe sim, foi realizado análise pelos porcentuais é foi possível ver nitídamente a diferença entre as taxas, dependendo do estado civil do cliente.

In [104]:
avg_family_status_debt.sort_values()

widow / widower      6.596859
divorced             7.136860
married              7.554833
civil partnership    9.360676
unmarried            9.768271
dtype: float64

### Existe Uma Relação Entre o Nível de Renda e o Pagamento de um Empréstimo no Prazo? <a id='renda'></a>

**Resposta**

Após separar os valores das rendas em catagorias, foi possível realizar algumas análises que notar que quanto mais alto a renda, maior a probabilidade de não deixar de pagar o empréstimo

In [105]:
avg_total_income_debt.sort_values()

income_status
great income         5.654762
good income          7.598320
low income           7.692308
median income        7.978437
reasonable income    8.554422
dtype: float64

### Como as diferentes finalidades do empréstimo afetam o pagamento pontual do empréstimo? <a id='finalidades'></a>

**Resposta**

Depois de categorizar todos os motivos de empréstimo dos clientes, foi realizado um calculo para trazer a porcentagem em relação a empréstimos não pagos e os seus motivos.

Onde foi possível chegar a conclusão que comprar um carro ou investir em educação foi o que deixou os empréstimos mais atrasados.

In [106]:
avg_purpose_debt

purpose
wedding      8.010336
education    9.243068
car          9.359721
property     7.250139
dtype: float64

[Voltar ao Índice](#back)

---

## Conclusão Final  <a id='end'></a>

Neste projeto foi colocado em prática todos as etapas de exploração de dados que foram aprendidas até a sprint 2 do curso "Ciêntista de Dados" da Practicum:

- Leitura dos dados
- Pré-processamento
- Análise dos dados
- Apresentado os resultados

Utilizei a linguagem python e a biblioteca pandas para realizar a manipulação desses dados, me possibilitando tratar todos os problemas encontrados na nossa amostra.

Depois dos dados tratados, foi realizado a categorização dos dados, onde foi criado uma nova coluna no dataframe, "points", onde é possível verificar a pontuação de um determinado cliente. Lembrando que quanto maior o número, maior é a tendência deste não pagar o empréstimo.

E no final comprovamos com números que as nossas hipóteses estavam corretas!

[Voltar ao Índice](#back)